/**
 . Напишите программу действий для сотрудника дорожной полиции, который остановил машину:
 + при езде до 50 км/час нарушений нет;
 + за езду от 50 км/час до 65 км/час — устное порицание и лекция на 5 минут;
 + за превышение скорости от 16 км/час — 40 евро штрафа;
 + за езду от 100 км/час до 130 км/час — штраф 500 евро;
 + и за езду свыше 130 км/час — штраф в 1000 евро, конфискация прав на 3 года и конфискация транспортного средства.
 */
public class Main {
    public static void main(String[] args) {
 
    }
}
